"""
# 先找这种跨步大的找到一个长一些的步长
L=[]
for i in range(187,10**12,187):
    if i%44==33 and i%45==29 and i%46==15 and i%47==5 and i%48==41 and i%49==46:
        L.append(i)
    if len(L)>=2:
        break
print(L)
"""

"""
L=[5458460249, 12590206409]
step=L[1]-L[0]

c=[2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43]
b=[1,2,1,4,5,4,1,2,9,0,5,10,11,14,9,0,11,18,9,11,11,15,17,9,23,20,25,16,29,27,25,11,17,4,29,22,37,23,9,1,11,11]
MAX=100000000000000000

def check(num):
    n=len(c)
    for i in range(n):
        if num%c[i]!=b[i]:
            return False
    return True
    
    
res=[]
for i in range(L[0],MAX,step):
    if check(i):
        res.append(i)
        break     

print(res)
"""
print(2022040920220409)


 
